In [6]:
print('Good evening')
print("hey! im learning :D")

Good evening
hey! im learning :D

In [10]:
q2=print("your message here!")

your message here!

In [11]:
#calculating no of seconds in a year
num_years=4
days_per_year = 365
hours_per_day = 24
mins_per_hour = 60
secs_per_min = 60

total_secs = secs_per_min * mins_per_hour * hours_per_day * days_per_year * num_years
print(total_secs)

126144000

In [15]:
# TODO: Set the value of the births_per_min variable
births_per_min = 250
hours_per_day = 24
mins_per_hour = 60

# TODO: Set the value of the births_per_day variable
births_per_day = births_per_min * mins_per_hour * hours_per_day
print (births_per_day)

360000

In [30]:
#load the titanic compitition data
import pandas as pd
titanic_data = pd.read_csv("train.csv")

titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
#total no. of passengers
total = len(titanic_data)
print(total)

891

In [25]:
#total survived
survived = (titanic_data.Survived == 1).sum()
print(survived)

342

In [28]:
#no. of passengers under 18
minors = (titanic_data.Age < 18).sum()
print(minors)

113

In [31]:
titanic_data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [39]:
survived_fraction = (titanic_data.Survived==1).sum()

# Print the value of the variable
print(survived_fraction)

minors_fraction = (titanic_data.Age<18).sum()

# Print the value of the variable
print(minors_fraction)

342
113